IRP/src/Documents/CalculationMovementCosts/CalculationMovementCosts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>CalculationMovementCosts</name>
 <registerRecords>InformationRegister.T6040S_BundleAmountValues</registerRecords>
 <registerRecords>AccumulationRegister.R6010B_BatchWiseBalance</registerRecords>
 <registerRecords>InformationRegister.T6080S_ReallocatedBatchesAmountValues</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>InformationRegister.T8510S_FixedAssetsInfo</registerRecords>
 <registerRecords>InformationRegister.T6090S_CompositeBatchesAmountValues</registerRecords>
 <registerRecords>AccumulationRegister.R6050T_SalesBatches</registerRecords>
 <registerRecords>AccumulationRegister.R6030T_BatchShortageOutgoing</registerRecords>
 <registerRecords>AccumulationRegister.R6040T_BatchShortageIncoming</registerRecords>
 <registerRecords>InformationRegister.T6095S_WriteOffBatchesInfo</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CalculationMode</name>
  <type>
   <types>EnumRef.CalculationMode</types>
  </type>
 </attributes>
 <attributes>
  <name>RaiseOnCalculationError</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:Document>

IRP/src/Enums/CalculationMode/CalculationMode.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CalculationMode</name>
 <enumValues>
  <name>LandedCost</name>
 </enumValues>
 <enumValues>
  <name>LandedCostBatchReallocate</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/CalculationMovementCosts/Forms/DocumentForm/Module.bsl
&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Key.IsEmpty() Then
		SetVisibilityAvailability(Object, ThisObject);
	EndIf;
	DocumentsServer.OnCreateAtServer(Object, ThisObject, Cancel, StandardProcessing);
EndProcedure

&AtClient
Procedure FormSetVisibilityAvailability() Export
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtClientAtServerNoContext
Procedure SetVisibilityAvailability(Object, Form)
	IsBatchReallocate = (Object.CalculationMode = PredefinedValue("Enum.CalculationMode.LandedCostBatchReallocate"));
	Form.Items.CalculationMode.ReadOnly = Not FOServer.IsUseBatchReallocate();
	Form.Items.Company.ReadOnly = IsBatchReallocate;
	Form.Items.Company.AutoMarkIncomplete = Not IsBatchReallocate;
EndProcedure

&AtClient
Procedure CalculationModeOnChange(Item)
	If Object.CalculationMode = PredefinedValue("Enum.CalculationMode.LandedCostBatchReallocate") Then
		Object.Company = Undefined;
	EndIf;
	SetVisibilityAvailability(Object, ThisObject);	
EndProcedure

&AtClient
Procedure CompanyOnChange(Item)
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

#Region COMMANDS

&AtClient
Procedure InternalCommandAction(Command) Export
	InternalCommandsClient.RunCommandAction(Command, ThisObject, Object, Object.Ref);
EndProcedure

&AtClient
Procedure InternalCommandActionWithServerContext(Command) Export
	InternalCommandActionWithServerContextAtServer(Command.Name);
EndProcedure

&AtServer
Procedure InternalCommandActionWithServerContextAtServer(CommandName)
	InternalCommandsServer.RunCommandAction(CommandName, ThisObject, Object, Object.Ref);
EndProcedure

&AtClient
Procedure GeneratedFormCommandActionByName(Command) Export
	ExternalCommandsClient.GeneratedFormCommandActionByName(Object, ThisObject, Command.Name);
	GeneratedFormCommandActionByNameServer(Command.Name);
EndProcedure

&AtServer
Procedure GeneratedFormCommandActionByNameServer(CommandName) Export
	ExternalCommandsServer.GeneratedFormCommandActionByName(Object, ThisObject, CommandName);
EndProcedure

#EndRegion
